export default {
  action: {
    add: {
      article: 'Добавить статью',
      comment: 'Добавить комментарий',
    },
    cancel: 'Отменить',
    close: 'Закрыть',
    delete: 'Удалить',
    edit: 'Редактировать',
    save: 'Сохранить',
  },
  company: {
    name: 'Андата',
  },
  confirm: {
    delete: 'Вы действительно хотите удалить',
  },
  field: {
    author: {
      article: 'Автор статьи',
      email: {
        article: 'Email автора статьи',
      },
    },
    content: 'Содержание',
    count: {
      comments: 'Количество комментариев',
    },
    createdAt: 'Создан',
    email: 'Электронная почта',
    text: {
      article: 'Текст статьи',
      comment: 'Текст комментария',
    },
    title: {
      article: 'Заголовок статьи',
      comment: 'Заголовок комментария',
    },
    username: 'Имя пользователя',
  },
  loader: {
    pleaseWait: 'Пожалуйста ожидайте...',
  },
  message: {
    error: {
      article: {
        create: 'Не удалось сохранить статью',
        delete: 'Не удалось удалить статью',
        getComments: 'Не удалось получить комментарии статьи',
        index: 'Не удалось получить список статей',
        show: 'Не удалось получить статью',
        update: 'Не удалось сохранить изменения в статье',
      },
      comment: {
        create: 'Не удалось сохранить комментарий',
      },
      validation: 'Ошибка валидации',
    },
    success: {
      article: {
        create: 'Статья сохранена успешно',
        delete: 'Статья удалена успешно',
        update: 'Статья отредактирована успешно',
      },
      comment: {
        create: 'Комментарий сохранен успешно',
        delete: 'Комментарий удален успешно',
        update: 'Комментарий отредактирован успешно',
      },
    },
  },
  project: {
    name: 'Блог - потомок Хабра',
  },
  table: {
    noData: {
      articles: 'Статьи не найдены',
      comments: 'Комментариев нет',
    },
  },
  title: {
    add: {
      article: 'Добавить статью',
      comment: 'Добавить комментарий',
    },
    article: 'Статья',
    comments: 'Комментарии',
    delete: {
      article: 'Удалить статью',
      comment: 'Удалить комментарий',
    },
    edit: {
      article: 'Редактировать статью',
      comment: 'Редактировать комментарий',
    },
  },
  validator: {
    email: 'Некорректный E-mail',
    minLength: 'Минимальная длина поля в символах',
    maxLength: 'Максимальная длина поля в символах',
    required: 'Поле является обязательным',
  },
}
